src/cf/InformationRegisters/пбп_СоответствиеОбъектовИнтегрируемыхСистем.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>пбп_СоответствиеОбъектовИнтегрируемыхСистем</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДополнительныйИдентификатор</Name>
					<Comment>Номер, код и пр. интегрируемой системы</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИнтегрируемаяСистема</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.пбп_ИнтегрируемыеСистемы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИнтеграционныйПоток</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.пбп_ИнтеграционныеПотоки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СсылкаНаОбъект</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.пбп_ОбъектыИнтегрируемыхСистем</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторСистемы</Name>
					<Comment>Уникальный идентификатор (uuid) или значение поля, гарантирующее уникальность записи (например, автоинкремент)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Catalogs/пбп_ИсторияИнтеграции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>пбп_ИсторияИнтеграции</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВходящееСообщение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИнтеграции</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИнтеграцииВМиллисекундах</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДлительностьВызова</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДлительностьОбмена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайлаСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнтеграционныйПоток</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.пбп_ИнтеграционныеПотоки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнтегрируемаяСистема</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.пбп_ИнтегрируемыеСистемы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсходящееСообщение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ошибка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.пбп_Пользователи</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПротоколОбмена</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвязьИстории</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.пбп_ИсторияИнтеграции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.пбп_СтатусыИнтеграции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлСообщения</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФорматИнтеграции</Name>
					<Type>
						<v8:Type>cfg:EnumRef.пбп_ФорматыИнтеграций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОбъектыИнтеграции</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОбъектИнтеграции</Name>
							<Type>
								<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипИдентификатора</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СозданОбновлен</Name>
							<Type>
								<v8:Type>cfg:EnumRef.пбп_СозданОбновлен</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДополнительнаяИнформация</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерВерсии</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтоЗаписьРегистра</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтборыРегистра</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/InformationRegisters/пбп_СоответствиеОбъектовИнтегрируемыхСистем/Forms/ФормаЗаписи/Ext/Form/Module.bsl
// Библиотека проектных подсистем для упрощения разработки архитектуры на 1С: Предприятие 8,
// включая доработку типовых конфигураций.
//
// Copyright First BIT company
//
//   Licensed under the Apache License, Version 2.0 (the "License");
//   you may not use this file except in compliance with the License.
//   You may obtain a copy of the License at
//
//       http://www.apache.org/licenses/LICENSE-2.0
//
//   Unless required by applicable law or agreed to in writing, software
//   distributed under the License is distributed on an "AS IS" BASIS,
//   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//   See the License for the specific language governing permissions and
//   limitations under the License.
//
// URL:    https://github.com/firstBitSportivnaya/PSSL/
//

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ОбъектИнтеграции"	, Запись.СсылкаНаОбъект);
	Запрос.УстановитьПараметр("ИнтегрируемаяСистема", Запись.ИнтегрируемаяСистема);
	Запрос.Текст = "ВЫБРАТЬ
	|	пбп_ИсторияИнтеграцииОбъектыИнтеграции.Ссылка.ДатаИнтеграции КАК ДатаИнтеграции,
	|	пбп_ИсторияИнтеграцииОбъектыИнтеграции.Ссылка.Ссылка КАК ИсторияИнтеграции,
	|	пбп_ИсторияИнтеграцииОбъектыИнтеграции.СозданОбновлен КАК СозданОбновлен
	|ИЗ
	|	Справочник.пбп_ИсторияИнтеграции.ОбъектыИнтеграции КАК пбп_ИсторияИнтеграцииОбъектыИнтеграции
	|ГДЕ
	|	пбп_ИсторияИнтеграцииОбъектыИнтеграции.ОбъектИнтеграции = &ОбъектИнтеграции
	|	И пбп_ИсторияИнтеграцииОбъектыИнтеграции.Ссылка.ИнтеграционныйПоток.НастройкаИнтеграции.ИнтегрируемаяСистема = &ИнтегрируемаяСистема
	|
	|СГРУППИРОВАТЬ ПО
	|	пбп_ИсторияИнтеграцииОбъектыИнтеграции.Ссылка.ДатаИнтеграции,
	|	пбп_ИсторияИнтеграцииОбъектыИнтеграции.Ссылка.Ссылка,
	|	пбп_ИсторияИнтеграцииОбъектыИнтеграции.СозданОбновлен
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаИнтеграции";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		ВыгрузкаРезультатаЗапроса = РезультатЗапроса.Выгрузить();
		Элементы.ПосмотретьИспользованияВИсторииИнтеграции.Заголовок = СтрШаблон(
			"Использований в истории интеграции: %1", ВыгрузкаРезультатаЗапроса.Количество());
		АдресДанныхСвязанныхИсторииИнтеграции = ПоместитьВоВременноеХранилище(
			ВыгрузкаРезультатаЗапроса, Новый УникальныйИдентификатор);
	Иначе
		Элементы.ПосмотретьИспользованияВИсторииИнтеграции.Заголовок = "Использований в истории интеграции не обнаружено";
		Элементы.ПосмотретьИспользованияВИсторииИнтеграции.Доступность = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийФормы

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПосмотретьИспользованияВИсторииИнтеграции(Команда)
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ИнтегрируемаяСистема"	, Запись.ИнтегрируемаяСистема);
	ПараметрыОткрытия.Вставить("СсылкаНаОбъект"			, Запись.СсылкаНаОбъект);
	ПараметрыОткрытия.Вставить("АдресСвязанныхДанных"	, АдресДанныхСвязанныхИсторииИнтеграции);
	
	ОткрытьФорму("РегистрСведений.пбп_СоответствиеОбъектовИнтегрируемыхСистем.Форма.ФормаСвязанныхЗаписейИстории",
		ПараметрыОткрытия, Запись, Новый УникальныйИдентификатор);
	
КонецПроцедуры

#КонецОбласти // ОбработчикиКомандФормы
